## Nodes
work_details = ['emp_length','emp_title']

applicationID = ['id','open_acc','pub_rec','issue_d']

address = ['zip_code','addr_state','home_ownership']

Loan = ['total_bal_il','funded_amount']

Status=['loan_status']

Purpose=['purpose']

Term=['term']

ApplicationType=['application_type']

In [1]:
import pandas as pd
import sys
import numpy as np
import os

In [2]:
data = pd.read_csv("data/graph_sample_data.txt",index_col=0)

In [55]:
data.info()
list(data.columns)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 699 entries, 0 to 700
Data columns (total 20 columns):
addr_state          699 non-null object
annual_inc          699 non-null float64
application_type    699 non-null object
dti                 699 non-null float64
dti_joint           0 non-null float64
emp_length          676 non-null object
emp_title           677 non-null object
funded_amnt         699 non-null float64
home_ownership      699 non-null object
issue_d             699 non-null object
loan_status         699 non-null object
member_id           0 non-null float64
open_acc            699 non-null float64
pub_rec             699 non-null float64
purpose             699 non-null object
term                699 non-null object
zip_code            699 non-null object
open_il_12m         0 non-null float64
total_bal_il        0 non-null float64
id                  699 non-null int64
dtypes: float64(9), int64(1), object(10)
memory usage: 114.7+ KB

['addr_state',
 'annual_inc',
 'application_type',
 'dti',
 'dti_joint',
 'emp_length',
 'emp_title',
 'funded_amnt',
 'home_ownership',
 'issue_d',
 'loan_status',
 'member_id',
 'open_acc',
 'pub_rec',
 'purpose',
 'term',
 'zip_code',
 'open_il_12m',
 'total_bal_il',
 'id']

In [5]:
# Create the folder if it already doesn't exist
if not os.path.exists('graph_csv'):
    os.makedirs('graph_csv')

### For terms

In [61]:
df = pd.DataFrame(data['term'].unique(),columns=['term'])
df.head()

         term
0   60 months
1   36 months

In [56]:
### Workdetail
df_workdetail = data[['emp_length','emp_title']].drop_duplicates()
df_workdetail.head(1)

  emp_length   emp_title
0  10+ years  MANAGEMENT

In [54]:
### applicationID
df_applicationID = data[['id','open_acc','pub_rec','issue_d']].drop_duplicates()
df_applicationID.head(1)

         id  open_acc  pub_rec   issue_d
0  38098114       6.0      0.0  Dec-2014

In [53]:
### Status
df_status = data[['loan_status']].drop_duplicates()
df_status.head(1)

  loan_status
0  Fully Paid

In [52]:
### Purpose
df_purpose = data[['purpose']].drop_duplicates()
df_purpose.head(1)

              purpose
0  debt_consolidation

In [51]:
### Application Type
df_application_type = data[['application_type']].drop_duplicates()
df_application_type.head(1)

  application_type
0       Individual

In [50]:
### Address
df_Address = data[['zip_code','addr_state','home_ownership']].drop_duplicates()
df_Address.head(1)

  zip_code addr_state home_ownership
0    235xx         VA           RENT

In [49]:
### Loan
df_loan = data[['total_bal_il','funded_amnt']].drop_duplicates()
df_loan.head(1)

   total_bal_il  funded_amnt
0           NaN      15000.0

In [ ]:
### Main Table
df_main = data[['purpose','term',]]